Revit 2024 API
ConicalFace.Axis Property
Axis of the surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public XYZ Axis { get; }
Visual Basic
Public ReadOnly Property Axis As XYZ
	Get
Visual C++
public:
property XYZ^ Axis {
	XYZ^ get ();
}
See Also
ConicalFace Class
Autodesk.Revit.DB Namespace